# <u>Data Frame creation and manipuation</u>

<h3><i> 1. Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3</h3></i>

In [65]:
import pandas as pd

student_details = [{"RollNO":18230,"Name":"Aaron","Gender":0,"Marks1":80,"Marks2":75,"Marks3":90},
                 {"RollNO":18231,"Name":"Rithesh","Gender":0,"Marks1":70,"Marks2":60,"Marks3":85},
                 {"RollNO":18232,"Name":"Nicole","Gender":1,"Marks1":65,"Marks2":55,"Marks3":72},
                 {"RollNO":18233,"Name":"Philip","Gender":0,"Marks1":64,"Marks2":33,"Marks3":81},
                 {"RollNO":18234,"Name":"Natalie","Gender":1,"Marks1":76,"Marks2":34,"Marks3":54},
                 {"RollNO":18235,"Name":"Sarah","Gender":1,"Marks1":87,"Marks2":79,"Marks3":68},
                 {"RollNO":18236,"Name":"Scott","Gender":0,"Marks1":57,"Marks2":88,"Marks3":62},
                 {"RollNO":18237,"Name":"Matthew","Gender":0,"Marks1":79,"Marks2":64,"Marks3":87},
                 {"RollNO":18238,"Name":"Sabine","Gender":1,"Marks1":87,"Marks2":93,"Marks3":88},
                 {"RollNO":18239,"Name":"Sophia","Gender":1,"Marks1":45,"Marks2":58,"Marks3":67}]
student_df = pd.DataFrame(student_details)
student_df.head(10)

   RollNO     Name  Gender  Marks1  Marks2  Marks3
0   18230    Aaron       0      80      75      90
1   18231  Rithesh       0      70      60      85
2   18232   Nicole       1      65      55      72
3   18233   Philip       0      64      33      81
4   18234  Natalie       1      76      34      54
5   18235    Sarah       1      87      79      68
6   18236    Scott       0      57      88      62
7   18237  Matthew       0      79      64      87
8   18238   Sabine       1      87      93      88
9   18239   Sophia       1      45      58      67

<h3><i>2. Create a new column with Total Marks</i></h3>

In [66]:
student_df["Total Marks"] = student_df[["Marks1","Marks2","Marks3"]].sum(axis=1)
student_df.head(10)

   RollNO     Name  Gender  Marks1  Marks2  Marks3  Total Marks
0   18230    Aaron       0      80      75      90          245
1   18231  Rithesh       0      70      60      85          215
2   18232   Nicole       1      65      55      72          192
3   18233   Philip       0      64      33      81          178
4   18234  Natalie       1      76      34      54          164
5   18235    Sarah       1      87      79      68          234
6   18236    Scott       0      57      88      62          207
7   18237  Matthew       0      79      64      87          230
8   18238   Sabine       1      87      93      88          268
9   18239   Sophia       1      45      58      67          170

<h3><i>3. Find the lowest Marks in Marks1</i></h3>

In [67]:
minMarks1 = student_df["Marks1"].min()
minMarks1

45

<h3><i>4. Find the Highest Marks in Marks2</i></h3>

In [68]:
maxMarks2 = student_df["Marks2"].max()
maxMarks2

93

<h3><i>5. Find the average Marks in Marks3</i></h3>

In [69]:
avgMarks3 = student_df["Marks3"].mean()
avgMarks3

75.4

<h3><i>6. Find the Student with highest Average</i></h3>

In [103]:
#student_df[student_df.iloc[:,3:6].mean(axis=1)==student_df.iloc[:,3:6].mean(axis=1).max()][["Name","RollNO"]]
Average = student_df.iloc[:,3:6].mean(axis=1)
student_df[Average == Average.max()][["Name","RollNO"]]

     Name  RollNO
8  Sabine   18238

<h3><i>7. Find how many students Failed in Marks2</i></h3>

In [63]:
failMarks2 = student_df[student_df["Marks2"]<40]
failMarks2.shape[0]

2